
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(PrintRoGaS)
	ТабДок = Новый ТабличныйДокумент;
	PrintRoGaS(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Истина;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура PrintRoGaS(ТабДок, ПараметрКоманды)
	Документы.ReceiptOfGoodsAndServises.PrintRoGaS(ТабДок, ПараметрКоманды);
КонецПроцедуры
