

//&НаКлиенте
//Процедура Execute(Команда)
//	ExecuteНаСервере();
//КонецПроцедуры

&НаКлиенте
Процедура История(Команда)
	ExecuteНаСервере();
КонецПроцедуры


&НаСервере
Процедура ExecuteНаСервере()
Настройки = Новый НастройкиИсторииДанных;
Настройки.Использование = Истина;
Настройки.ИспользованиеПолей.Вставить("Наименование", Истина);
Настройки.ИспользованиеПолей.Вставить("goods", Истина);
ИсторияДанных.УстановитьНастройки(Метаданные.Справочники.Nomenklatura, Настройки);

//Настройки = Новый НастройкиИсторииДанных;
//Настройки.Использование = Истина;
//Настройки.ИспользованиеПолей.Вставить("Комментарий", Истина);
//Настройки.ИспользованиеПолей.Вставить("Товары.Цена", Истина);
//ИсторияДанных.УстановитьНастройки(Метаданные.Документы.Заказ, Настройки);

//Отбор = Новый Структура("Данные, ИзменениеЗначенийПолей");
//Отбор.Данные = Документы.Заказ.НайтиПоНомеру("0000001");
//Отбор.ИзменениеЗначенийПолей = Новый Массив;
//Отбор.ИзменениеЗначенийПолей.Вставить("ПозицииЗаказа.Количество");
//Версии = ИсторияДанных.ВыбратьВерсии(Отбор, "НомерВерсии, Дата, ТипИзменения, ИмяПользователя, Комментарий");

//СформироватьПоВерсии().

//http://1c.ruboard.ru/public/699109/
КонецПроцедуры
