
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр TotalSeal 
	Движения.TotalSeal.Записывать = Истина;
	Для Каждого ТекСтрокаGoodsAndServices Из GoodsAndServices Цикл
		Движение = Движения.TotalSeal.Добавить();
		Движение.Период = Дата;
		Движение.Contractor = Contractor;
		Движение.Deal = Deal;
		Движение.Storage = Storage;
		Движение.GaS = ТекСтрокаGoodsAndServices.GaS;
		Движение.Summ = ТекСтрокаGoodsAndServices.Summ;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
